-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 18, 2026 at 10:00 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `final032`
--

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `author` varchar(100) NOT NULL,
  `publisher` varchar(100) DEFAULT NULL,
  `price` decimal(10,2) NOT NULL,
  `description` text DEFAULT NULL,
  `imageUrl` varchar(255) DEFAULT NULL,
  `category_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `title`, `author`, `publisher`, `price`, `description`, `imageUrl`, `category_id`) VALUES
(1, 'Good Vibes Good Life (ใช้คลื่นพลังบวกดึงดูดพลังสุข)', 'Vex King (เว็กซ์ คิงส์)', 'อมรินทร์ How to', 245.00, ' ความลับของการบรรลุในสิ่งยิ่งใหญ่คือการเข้าใจ กฎแห่งแรงสั่นสะเทือนที่กล่าวว่าทุกอย่างในจักรวาลล้วนเกิดจากแรงสั่นสะเทือนทุกแรงสั่นสะเทือนที่มีความถี่ตรงกันสามารถดึงดูดกันได้ อย่าเผลอไผลไปตามสมองที่ติดนิสัยชอบผลักไสโชคและสิ่งดีๆด้วยพลังลบยิ่งคุณส่งคลื่นพลังบวกออกสู่ภายนอก จักรวาลจะยิ่งสะท้อนคลื่นความสุขกลับมาเท่าทวีคูณ ทุกคำพูด อารมณ์ และการกระทำของคุณเปลี่ยนชีวิตคุณได้ทันที\r\n\r\n   เว็กซ์ คิงส์ ผู้ได้รับการยกย่องว่าเป็นผู้นำทางจิตวิญญาณแก่คนรุ่นใหม่จะเปลี่ยนคลื่นความถี่ทางอารมณ์ของคุณให้ตรงกับพลังงานบวกทั้งหลาย เพื่อดึงดูดความสุขและความสำเร็จอย่างที่คุณอาจไม่เคยคิดฝัน\r\n\r\n     เราจะเรียนรู้วิธีรักตัวเองอย่างแท้จริงได้อย่างไร จะเปลี่ยนอารมณ์ลบไปเป็นด้านบวกได้อย่างไร แล้วการมองหาความสุขที่ยั่งยืนนั้นเป็นไปได้จริงไหม เว็กซ์ คิง อินฟลูเอนเซอร์ จะตอบคำถามเกี่ยวกับการใช้ชีวิตที่คนส่วนใหญ่สงสัย นำเสนอในภาษาที่อ่านง่าย ย่อยเป็นหัวข้อสั้นๆ มีภาพประกอบและแทรก Quote เป็นแรงบันดาลใจ \r\n\r\n- ฝึกฝนการดูแลตัวเอง เอาชนะพลังงานในแง่ลบ และยึดความสุขของตัวเองเป็นที่ตั้ง แคร์สายตาคน อื่นให้น้อยลง\r\n- ฝึกฝนให้ตัวเองมีนิสัยเชิงบวก เช่น การฝึกสติและสมาธิ\r\n- เปลี่ยนมุมมอง เปิดรับโอกาสใหม่ ๆ เข้ามาในชีวิต\r\n- ทำเป้าหมายให้ชัดเจน ด้วยการทดลองซ้ำ ๆ \r\n- เอาชนะความกลัว \r\n- มองหาเป้าหมายที่สูงกว่าเดิม เเละกลายเป็นฝ่ายชี้นำคนอื่นบ้าง', 'http://127.0.0.1/final032/images/1.webp', 1),
(2, 'The Psychology of Money (จิตวิทยาว่าด้วยเงิน)', 'Morgan Housel (มอร์แกน เฮาส์เซล)', 'ลีฟ ริช / Live Rich', 290.00, '\"เงิน\" พรอันประเสริฐและคำสาปแช่งอันขมขื่นต่อชีวิตความเป็นอยู่ของเรา    \r\n\r\nหลายคนเหลือกินเหลือใช้ หลายคนอดมื้อกินมื้อ    \r\nหลายคนนอนอุ่น หลายคนไร้บ้าน    \r\nหลายคนมั่งคั่งเพิ่มขึ้นในระดับวินาที\r\nหลายคนไม่เคยจะมีตลอดชั่วนาตาปี    \r\nหลายคนสุขสบาย หลายคนขมขื่นข้นแค้น    \r\nและอีกมากมาย ทั้งหมดนี้ล้วนแล้วแต่เป็นผลมาจากเงินทั้งสิ้น… จริงหรือ?    \r\n\r\nหากระยะเวลา คือหนึ่งในตัวแปรต่อความชำนาญในสิ่งใดๆ\r\nคนเราก็น่าจะมีทักษะทางการเงินที่ดีพอจนสามารถสร้างสมดุลในการใช้ชีวิตได้\r\nไปจนถึงการได้มาซึ่งอิสรภาพและการใช้ชีวิตตามแบบที่ใจปรารถนา\r\nเพราะเงินนั้นวนเวียนอยู่กับเราตั้งแต่วินาทีที่ลืมตาดูโลกจนถึงวาระสุดท้ายของชีวิต\r\nแต่ในโลกแห่งความเป็นจริงก็เป็นอย่างที่เรารู้ๆกัน    \r\n\r\nหนังสือเล่มนี้ จะพาคุณไปกะเทาะเปลือกความเป็นมนุษย์ เพื่อให้คุณได้เห็นว่า...\r\n\"เมื่อเป็นเรื่องเงิน รู้อะไรไม่สำคัญเท่าทำอย่างไร และการตัดสินใจลงมือทำ\r\nเพื่อให้ได้ผลลัพธ์ที่ดีนั้นเป็นสิ่งที่สอนกันได้ยากยิ่ง\"', 'http://127.0.0.1/final032/images/2.webp', 3),
(3, 'English at Office (ภาษาอังกฤษฉบับออฟฟิศ)', 'THE FIRM', 'ดี สนพ./D Publishing', 195.00, ' หากคุณไม่ต้องการประสบปัญหาการสื่อสารภาษาอังกฤษในองค์กร หนังสือเล่มนี้ช่วยคุณได้ไม่มากก็น้อยสำหรับการใช้ชีวิตประจำวันให้อยู่รอดปลอดภัยเเบบง่าย ๆ สื่อสารภาษาอังกฤษกับบรรดาเพื่อนร่วมงานเจ้านายชาวต่างประเทศได้ทั้งในการทักทาย เเนะนำตัว พูดคุย ติดต่อประสานงานหรือการนำเสนองานต่าง ๆรวมทั้งรวบรวมคลังคำศัพท์ที่จำเป็นสำหรับการทำงานเอาไว้มากมายท้ายเล่มซึ่งเหมาะกับเจ้าหน้าที่ระดับต้นจนถึงระดับกลางใช้เป็นคู่มือเบื้องต้นเป็นอย่างยิ่งก่อนจะก้าวไปเรียนรู้ภาษาอังกฤษในระดับสูงต่อไป', 'http://127.0.0.1/final032/images/3.webp', 2),
(4, 'basic Coding Web Developer HTML5, CSS3,JavaScript', 'ศุภชัย สมพานิช', 'อินโฟเพรส/Infopress', 380.00, 'เรียนรู้หลักการพัฒนาเว็บแอปพลิเคชันด้วยภาษา HTML5, CSS และ JavaScript ตั้งแต่เริ่มต้น โดยเน้นให้ผู้อ่านเรียนรู้คำสั่งและอีลีเม็นต์ต่างๆ, หลักการทำงานที่จำเป็นสำหรับกาพัฒนาเว็บแอปพลิเคชัน, การสร้างเว็บฟอร์ม, การทำงานกับไฟล์วีดีโอและไฟล์เสียง, การตกแต่งเว็บเพจด้วย CSS, การจัดการรูปภาพและระบบสี, การจัดการด้านการพิมพ์, การใช้งานภาษา JavaScript, การพัฒนา Web Apps แบบคอนเทนเนอร์ด้วย Docker จนสามารถนำไปประยุกต์ใช้พัฒนาเว็บไซต์ได้จริง พร้อม Workshop ให้ศึกษาการทำงานอย่างเป็นขั้นตอน เหมาะสำหรับนักเรียน นักศึกษา และผู้ที่สนใจพัฒนาเว็บไซต์ด้วยตนเอง', 'http://127.0.0.1/final032/images/4.webp', 4),
(5, 'ATOMIC HABITS เพราะชีวิตดีได้กว่าที่เป็น', 'James Clear (เจมส์ เคลียร์)', 'เชนจ์พลัส/Change+', 285.00, 'จากหนังสือขายดีระดับโลกที่มียอดขายหลายล้านเล่ม แปลไปแล้วกว่า 40 ภาษา การันตีความดีงามโดย \"New York Times Bestseller\" นี่คือหนังสือเกี่ยวกับการเปลี่ยนแปลงนิสัย โดยใช้หลักการทางวิทยาศาสตร์มาอ้างอิงว่าการเปลี่ยนแปลงเล็กๆ ที่เล็กมากๆ จะนำไปสู่การเปลี่ยนแปลงที่ใหญ่ขึ้นได้อย่างไร ซึ่งหลักการนี้สามารถประยุกต์ใช้ได้กับทุกเรื่อง เช่น การทำงาน การเงิน ความสัมพันธ์ระหว่างบุคคล สุขภาพ ความคิดสร้างสรรค์ ไม่ว่าเป้าหมายของเราคืออะไรก็ตาม หนังสือเล่มนี้จะช่วยเปลี่ยนแปลงนิสัยและคงนิสัยดีๆ ไว้ได้นานเท่านาน\r\n\r\n  หากคุณพยายามเปลี่ยนแปลงตัวเองแต่ไม่สำเร็จสักที หนังสือเล่มนี้ช่วยคุณได้! ด้วยการพัฒนาตัวเองให้ดีขึ้นเพียงวันละ 1% ไม่ว่าเป้าหมายในชีวิตของคุณคืออะไร คุณทำสำเร็จได้อย่างแน่นอน!', 'http://127.0.0.1/final032/images/5.webp', 1),
(7, 'How to live like your Cat เมื่อแมวที่บ้านคุณผันตัวเองมาเป็นไลฟ์โค้ช', 'Stephane Garnier', 'เลิร์น (WeLearn)', 175.00, 'นึกถึงตัวเองเป็นอันดับแรกไม่เคยเปรียบเทียบตัวเองกับใครไม่มานั่งกังวลเรื่องอดีตหรืออนาคตไม่ปล่อยให้เรื่องแย่ ๆ มาทำลายวันดี ๆใช้ชีวิตง่าย ๆ สบาย ๆ แบบนี้เห็นจะมีแต่แมวเท่านั้น!พบกับ 40 คำแนะนำที่จะทำให้ชีวิตคุณเบาสบายขึ้นในทุก ๆ ด้านจากไลฟ์โค้ชขนฟูที่อยู่เคียงข้างคุณมาตลอด', 'http://127.0.0.1/final032/images/7.webp', 1),
(8, 'Money 101 ปกใหม่', 'จักรพงษ์ เมษพันธุ์', 'ซีเอ็ดยูเคชั่น/se-ed', 295.00, 'รวบรวมหลักคิดและวิธีการบริหารเงิน รวมไปถึงวิธีวางแผนการเงินส่วนบุคคล ที่โค้ชใช้สอนและบรรยายให้กับผู้คนหลายหมื่นคนมาตลอด 14 ปี กลั่นเป็นเนื้อหาที่อ่านง่าย เป็นขั้นเป็นตอน เหมาะสำหรับผู้เริ่มต้นศึกษาเรื่องการเงินทุกคน\r\n \r\n   ในเล่มบอกเล่าเรื่องการเงินตั้งแต่การตั้งเป้าหมาย การจัดทำงบการเงินส่วนบุคคล การบริหารสภาพคล่อง การจัดสรรเงินออม การจัดการความเสี่ยง การวางแผนภาษี การวางแผนเกษียณรวย และเกษียณเร็ว เพื่อให้พบอิสระทางการเงินได้ตั้งแต่ในวัยหนุ่มสาว พร้อมแทรกกรณีศึกษาจากเรื่องราวชีวิตของลูกศิษย์ของโค้ชหนุ่มอีกมากมาย\r\n\r\n   ในฉบับครบรอบ 1 แสนเล่มนี้ ได้เพิ่มกรณีศึกษาของลูกศิษย์ แบบฝึกหัด และแนวทางการนำหลักคิดไปใช้ให้ประสบความสำเร็จ เพื่อให้ผู้อ่านได้ประโยชน์สูงสุด', 'http://127.0.0.1/final032/images/8.webp', 3),
(9, 'Money Mastery มั่งคั่งทั้งชีวิต', 'ทรพล ศิลปาจารย์ (พอล)', 'ไอแอมเดอะเบสท์/I AM THE BEST', 299.00, '  เงินหายมหาศาลเพราะขาดความรู้ด้านการเงินถ้านำเงิน 100,000 บาท ไปลงทุนใช้เวลา 30 ปีได้รับผลตอบแทนอัตราที่ต่างกัน แต่ที่เหลือเหมือนกันหมด เงินที่ได้จะต่างกันมากนะครับผมคำนวณมาให้เห็นภาพมากขึ้น\r\n\r\n1% ต่อปี = 134,784\r\n\r\n5% ต่อปี = 432,194\r\n\r\n10% ต่อปี = 1,744,970\r\n\r\n15% ต่อปี = 6,621177\r\n\r\n20% ต่อปี = 23,737,631\r\n\r\n25% ต่อปี = 80,779,356\r\n\r\n    เงินเท่ากัน เวลายาวนานเท่ากันแต่ผลตอบแทนต่างกัน เงินที่ได้ก็ต่างกันมหาศาล\r\n\r\nอยากได้เท่าไหร่ครับ...แน่นอนว่าคุณอยากได้มากที่สุดเพราะฉะนั้นหลีกเลี่ยงไม่ได้ว่าคุณจะต้องมี\r\n\r\nความรู้ทางด้านการเงินเพราะยิ่งรู้มาก ผลตอบแทนก็ยิ่งมากรู้ไม่เท่ากันผลตอบแทนไม่เท่ากัน', 'http://127.0.0.1/final032/images/9.webp', 3),
(10, 'THINK AGAIN คิดแล้ว คิดอีก', 'Adam Grant (อดัม แกรนต์)', 'วีเลิร์น (WeLearn)', 395.00, 'การคิดเป็นคุณสมบัติที่สำคัญที่สุดของมนุษย์\r\nหากปราศจากมัน เราย่อมไม่สามารถแก้ปัญหา\r\nเรียนรู้สิ่งใหม่ หรือแม้แต่สร้างอารยธรรมขึ้นมา\r\n\r\nแต่ขณะเดียวกัน  การคิดก็อาจเป็นจุดอ่อนของมนุษย์เราเช่นกัน\r\n\r\nTHINK AGAIN คิดแล้ว, คิดอีก เขียนโดย Adam Grant นักจิตวิทยาชื่อดัง จะพาคุณท่องไปในโลกของการคิด\r\nเพื่อสำรวจว่าอะไรคือสิ่งที่คุณรู้จริง สิ่งที่คุณไม่รู้ และสิ่งที่คุณคิดว่าคุณรู้\r\nรวมถึงสาเหตุที่ผู้คนมากมายยังคงยึดติด มืดบอด และเดินเข้าสู่วงจรหายนะ\r\nพร้อมทั้งเสนอแนวทางที่จะช่วยให้เราหลุดพ้นจากวงจรนี้', 'http://127.0.0.1/final032/images/10.webp', 1),
(11, 'เตรียมสอบ TGAT English Communication', 'ทีวี จูเนียร์', 'GANBATTE', 279.00, 'เตรียมสอบ TGAT English Communication\r\n\r\nรวมแนวข้อสอบและแบบฝึกหัดเสริมมากถึง 16 รูปแบบ กว่า 800 ข้อพร้อมเฉลย\r\nอัดแน่นไปด้วยคำศัพท์ วลี สำนวน สุภาษิต คำพังเพย และไวยากรณ์ที่ควรรู้\r\nครอบคลุมทุกเรื่องที่ข้อสอบออกบ่อยที่สุด เหมาะสำหรับใช้อ่านทบทวนและ\r\nเตรียมตัวก่อนสอบ TCAS และสนามสอบอื่นๆ วิเคราะห์แนวข้อสอบโดยอาจารย์\r\nและผู้เชี่ยวชาญระดับประเทศ อาจารย์ทีวี จูเนียร์ ผู้เขียนสรรพศัพท์ GAT & TCAS', 'http://127.0.0.1/final032/images/11.webp', 2),
(12, 'จับตาย! วายร้ายTGAT1:English Communicati', 'สุรชัย รอดงาม', 'ฟุกุโร FUGUROU', 249.00, 'ติวเข้มแนวข้อสอบการสื่อสารภาษาอังกฤษรูปแบบใหม่ กว่า 700 ข้อ ตามโครงสร้างข้อสอบที่ประกาศล่าสุด เน้นทักษะ Speaking Skill \r\nและ Reading Skill แบ่งออกเป็น Question-Response (ข้อสอบถาม-ตอบ) Short Conversations (บทสนทนาสั้น) \r\nLong Conversations (บทสนทนายาว) Text Completion (การเติมข้อความในเนื่อเรื่องให้สมบูรณ์) \r\nและ Reading Comprehension (การอ่านเพื่อจับใจความ) พิเศษกว่าใคร รวบรวมสำนวน A-Z ที่ออกสอบบ่อย \r\nพร้อมแนวข้อสอบและคำตอบมัดใจรอบสอบสัมภาษณ์ ประยุกต์ใช้ให้เข้ากับตัวเองได้จริง', 'http://127.0.0.1/final032/images/12.webp', 2),
(17, 'DOPAMINE NATION ใดๆ ในโลกล้วน...โดพามีน', 'Anna Lembke, M.D.', 'แคนตัส พับลิชชิ่ง/Cactus Publishing', 325.00, 'ใดๆ ในโลกล้วน    โดพามีนติดหวานเฮโรอีน   ซีรีส์อดเสพอาจมีวีน    หรือเจ็บ (ปวดนา) แรงนักอาจถึงที่    อย่าคิดดูเบาสมมติว่ามีคนมาถามว่าตอนนี้คุณติดอะไรหรือไม่ คุณอาจคิดอยู่สักครู่และตอบว่า ไม่ติดกินหวานเวลาเหนื่อยๆ เครียดๆ ก็คงไม่ร้ายแรง ติดดูซีรีส์ข้ามวันข้ามคืนก็คงไม่เป็นอะไร ติดอ่านนิยายก่อนนอนจนนอนไม่หลับ เดี๋ยวอ่านจบก็คงดีขึ้นเอง ทั้งหมดนี้คุณคิดว่า “ไม่เป็นอะไร” หารู้ไม่ ทุกอย่างในโลกนี้ล้วนขับเคลื่อนด้วย “โดพามีน” มันถูกนำมาใช้เพื่อประโยชน์ทางการตลาด เพื่อเงินที่หลั่งไหลเข้ากระเป๋านายทุน และเพื่อโลกที่เต็มไปด้วยการบริโภคเกินอย่างในทุกวันนี้คุณอาจคิดว่าตัวเองไม่ได้ใกล้ชิดอะไรกับโดพามีน และถึงแม้จะมีกับเขาบ้าง มันก็อาจไม่ได้ร้ายแรงต่อชีวิตอะไรมากนัก แน่ใจหรือ...รู้ตัวอีกทีคุณอาจไปไกลจนกลับมาที่เดิมไม่ได้อีกแล้วยินดีต้อนรับเข้าสู่โลกแห่งรางวัลและความเจ็บปวดที่มีเส้นคั่นไว้เพียงบางๆ บางที “อนิจจัง” กับ “โดพามีน” อาจใกล้เคียงกันเหลือเกินก็ได้', 'http://127.0.0.1/final032/images/14.webp', 1);

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`) VALUES
(4, 'Computer'),
(2, 'English'),
(3, 'Finance'),
(1, 'Psychology & Self-Development');

-- --------------------------------------------------------

--
-- Table structure for table `favorites`
--

CREATE TABLE `favorites` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `book_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `favorites`
--

INSERT INTO `favorites` (`id`, `user_id`, `book_id`) VALUES
(6, 1, 11),
(12, 1, 12);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('user','admin') DEFAULT 'user'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`, `role`) VALUES
(1, 'Naseefa Salaeh', 'naseefa@gmail.com', '$2y$10$QYzbKR31VKfZxwW.4qkCfuCq4b3QA0inUG0wK52AQQ5vkUVh9ETkK', 'admin'),
(12, 'zee', 'zee@gmail.com', '$2y$10$JVCiHZ7Atn8pQS/SvlO1leilbakHrkV3WKVWT1XeNsE0A1GVYvDwO', 'user');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `favorites`
--
ALTER TABLE `favorites`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `book_id` (`book_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `favorites`
--
ALTER TABLE `favorites`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `books`
--
ALTER TABLE `books`
  ADD CONSTRAINT `books_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `favorites`
--
ALTER TABLE `favorites`
  ADD CONSTRAINT `favorites_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `favorites_ibfk_2` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
